<?php
$lang = array();

$lang['user_blocked'] = "บัญชีของคุณถูกล๊อคโดยระบบ";
$lang['user_verify_failed'] = "รหัสยืนยันไม่ถูกต้อง";

$lang['email_password_invalid'] = "อีเมลหรือรหัสผ่านไม่ถูกต้อง";
$lang['email_password_incorrect'] = "อีเมลหรือรหัสผ่านไม่ถูกต้อง";
$lang['remember_me_invalid'] = "The remember me field is invalid.";

$lang['password_short'] = "รหัสผ่านสั้นเกินไป";
$lang['password_weak'] = "รหัสผ่านคาดเดาง่ายเกินไป";
$lang['password_nomatch'] = "ยินยันรหัสผ่านไม่ตรงกัน";
$lang['password_changed'] = "เปลี่ยนรหัสผ่านเรียบร้อยแล้ว";
$lang['password_incorrect'] = "รหัสผ่านปัจจุบันไม่ถูกต้อง";
$lang['password_notvalid'] = "รหัสผ่านไม่ถูกต้อง";

$lang['newpassword_short'] = "รหัสผ่านที่ตั้งใหม่สั้นเกินไป";
$lang['newpassword_long'] = "รหัสผ่านที่ตั้งใหม่ยาวเกินไป";
$lang['newpassword_invalid'] = "รหัสผ่านที่ตั้งใหม่จะต้องมีตัวพิมพ์ใหญ่, ตัวพิมพ์เล็ก และตัวเลขอย่างน้อยอย่างละ 1 ตัว";
$lang['newpassword_nomatch'] = "ยืนยันรหัสผ่านที่ตั้งใหม่ไม่ตรงกัน";
$lang['newpassword_match'] = "รหัสผ่านที่ตั้งใหม่เหมือนกับรหัสผ่านเก่า";

$lang['email_short'] = "อีเมลสั้นเกินไป";
$lang['email_long'] = "อีเมลยาวเกินไป";
$lang['email_invalid'] = "อีเมลไม่ถูกต้อง";
$lang['email_incorrect'] = "อีเมลไม่ถูกต้อง";
$lang['email_banned'] = "อีเมลนี้จะไม่ได้รับอนุญาตให้ใช้งาน";
$lang['email_changed'] = "เปลี่ยนที่อยู่อีเมลเรียบร้อยแล้ว";

$lang['newemail_match'] = "อีเมลใหม่ตรงกับอีเมลก่อนหน้านี้";

$lang['account_inactive'] = "บัญชียังไม่ได้เปิดใช้งาน";
$lang['account_activated'] = "เปิดใช้งานบัญชีแล้ว";

$lang['logged_in'] = "คุณได้เข้าสู่ระบบเรียบร้อยแล้ว";
$lang['logged_out'] = "คุณได้ออกจากระบบเรียบร้อยแล้ว";

$lang['system_error'] = "ระบบได้เกิดความผิดพลาด โปรดลองใหม่อีกครั้ง";

$lang['register_success'] = "บัญชีผู้ใช้ได้ถูกสร้างเรียบร้อยแล้ว และระบบได้ทำการส่งอีเมลสำหรับยืนยันการเปิดบัญชีแล้ว โปรดตรวจสอบอีเมล";
$lang['register_success_emailmessage_suppressed'] = "บัญชีผู้ใช้ได้ถูกสร้างเรียบร้อยแล้ว";
$lang['email_taken'] = "อีเมลนี้มีอยู่ในระบบอยู่แล้ว";

$lang['resetkey_invalid'] = "รหัสยืนยันการรีเซ็ตรหัสผ่านไม่ถูกต้อง";
$lang['resetkey_incorrect'] = "รหัสยืนยันการรีเซ็ตรหัสผ่านไม่ถูกต้อง";
$lang['resetkey_expired'] = "รหัสยืนยันการรีเซ็ตรหัสผ่านหมดอายุแล้ว";
$lang['password_reset'] = "รีเซ็ตรหัสผ่านเรียบร้อยแล้ว";

$lang['activationkey_invalid'] = "รหัสยืนยันการเปิดบัญชีไม่ถูกต้อง";
$lang['activationkey_incorrect'] = "รหัสยืนยันการเปิดบัญชีไม่ถูกต้อง";
$lang['activationkey_expired'] = "รหัสยืนยันการเปิดบัญชีหมดอายุแล้ว";

$lang['reset_requested'] = "คำขอรีเซ็ตรหัสผ่านส่งไปยังที่อยู่อีเมล";
$lang['reset_requested_emailmessage_suppressed'] = "ระบบสร้างคำขอรีเซ็ตรหัสผ่านแล้ว";
$lang['reset_exists'] = "คำขอรีเซ้ตรหัสผ่านมีอยู่แล้ว";

$lang['already_activated'] = "บัญชีผู้ใช้นี้ได้ทำการยืนยันเรียบร้อยแล้ว";
$lang['activation_sent'] = "ได้ส่งอีเมลสำหรับยืนยันการเปิดบัญชีแล้ว";
$lang['activation_exists'] = "ส่งอีเมลยืนยันการใช้งานได้ถูกส่งไปแล้ว";

$lang['email_activation_subject'] = '%s - ยืนยันการเปิดใช้งานบัญชี';
$lang['email_activation_body'] = 'สวัสดี,<br/><br/>เพื่อให้สามารถเข้าสู่ระบบบัญชีของคุณ คุณต้องเปิดใช้งานบัญชีของคุณได้โดยไปที่ลิงค์ต่อไปนี้ : <strong><a href="%1$s/%2$s">%1$s/%2$s</a></strong><br/><br/> แล้วกรอกรหัสที่แนบมาเพื่อเปิดใช้งานบัญชี: <strong>%3$s</strong><br/><br/> หากคุณไม่ได้ลงทะเบียนที่ %1$s เมื่อเร็ว ๆ นี้แล้วข้อความนี้ถูกส่งโดยข้อผิดพลาดของระบบ โปรดอย่าสนใจ';
$lang['email_activation_altbody'] = 'สวัสดี, ' . "\n\n" . 'เพื่อให้สามารถเข้าสู่ระบบบัญชีของคุณ คุณต้องเปิดใช้งานบัญชีของคุณได้โดยไปที่ลิงค์ต่อไปนี้ :' . "\n" . '%1$s/%2$s' . "\n\n" . 'แล้วกรอกรหัสที่แนบมาเพื่อเปิดใช้งานบัญชี: %3$s' . "\n\n" . 'หากคุณไม่ได้ลงทะเบียนที่ %1$s เมื่อเร็ว ๆ นี้แล้ว ข้อความนี้ถูกส่งโดยข้อผิดพลาดของระบบ โปรดอย่าสนใจ';

$lang['email_reset_subject'] = '%s - ได้ทำการขอตั้งค่ารหัสผ่านใหม่';
$lang['email_reset_body'] = 'สวัสดี,<br/><br/>ในการรีเซ็ตรหัสผ่านของคุณเพื่อตั้งค่ารหัสผ่านใหม่ได้โดยไปที่ลิงค์ต่อไปนี้ :<br/><br/><strong><a href="%1$s/%2$s">%1$s/%2$s</a></strong><br/><br/>แล้วกรอกรหัสที่แนบมาเพื่อตั้งค่ารหัสผ่านใหม่: <strong>%3$s</strong><br/><br/>หากคุณไม่ได้ทำการร้องขอรีเซ็ตรหัสผ่านบน %1$s เมื่อเร็ว ๆ นี้แล้ว ข้อความนี้ถูกส่งโดยข้อผิดพลาดของระบบ โปรดอย่าสนใจ';
$lang['email_reset_altbody'] = 'สวัสดี, ' . "\n\n" . 'ในการรีเซ็ตรหัสผ่านของคุณเพื่อตั้งค่ารหัสผ่านใหม่ได้โดยไปที่ลิงค์ต่อไปนี้ :' . "\n" . '%1$s/%2$s' . "\n\n" . 'แล้วกรอกรหัสที่แนบมาเพื่อตั้งค่ารหัสผ่านใหม่: %3$s' . "\n\n" . 'หากคุณไม่ได้ทำการร้องขอรีเซ็ตรหัสผ่านบน %1$s เมื่อเร็ว ๆ นี้แล้ว ข้อความนี้ถูกส่งโดยข้อผิดพลาดของระบบ โปรดอย่าสนใจ';

$lang['account_deleted'] = "ลบบัญชีผู้ใช้เรียบร้อยแล้ว";
$lang['function_disabled'] = "ฟังก์ชั่นนี้ได้ถูกปิดการใช้งาน";
$lang['account_not_found'] = "ไม่พบบัญชีผู้ใช้งานจากอีเมลนี้";

return $lang;
