<?php
$lang = array();

$lang['user_blocked'] = "В даний час ви заблоковані системою.";
$lang['user_verify_failed'] = "Захисний код недійсний.";

$lang['email_password_invalid'] = "Неприпустимі поштова адреса або пароль.";
$lang['email_password_incorrect'] = "Користувач із зазначеною поштовою адресою невиявлений в системі або пароль не підходить.";
$lang['remember_me_invalid'] = 'Неприпустиме значення поля «запам\'ятати користувача».';

$lang['password_short'] = "Пароль занадто короткий.";
$lang['password_weak'] = "Пароль занадто ненадійний.";
$lang['password_nomatch'] = "Паролі не співпадають.";
$lang['password_changed'] = "Пароль успішно змінений.";
$lang['password_incorrect'] = "Поточний пароль вказано невірно.";
$lang['password_notvalid'] = "Неприпустимий пароль.";

$lang['newpassword_short'] = "Новий пароль занадто короткий.";
$lang['newpassword_long'] = "Новий пароль занадто довгий.";
$lang['newpassword_invalid'] = "Новий пароль повинен містити хоча б одну цифру, хоча б одну малу літеру і хоча б одну прописну.";
$lang['newpassword_nomatch'] = "Нові паролі не збігаються.";
$lang['newpassword_match'] = "Новий пароль такий же, як старий.";

$lang['email_short'] = "Поштова адреса занадто коротка.";
$lang['email_long'] = "Поштова адреса занадто довга.";
$lang['email_invalid'] = "Неприпустима поштова адреса.";
$lang['email_incorrect'] = "Поштова адреса невірна.";
$lang['email_banned'] = "Ця поштова адреса заборонена.";
$lang['email_changed'] = "Поштова адреса змінена успішно.";
$lang['email_taken'] = "Ця поштова адреса вже використовується!";

$lang['newemail_match'] = "Нова поштова адреса збігається зі старою.";

$lang['account_inactive'] = "Обліковий запис ще не активовано.";
$lang['account_activated'] = "Обліковий запис активовано.";

$lang['logged_in'] = "Ви увійшли в систему.";
$lang['logged_out'] = "Ви вийшли з системи.";

$lang['system_error'] = "Відбулася системна помилка (проблема з cookies, сесією або базою даних). Спробуйте ще раз.";

$lang['register_success'] = "Обліковий запис створено. На вашу пошту відправлена інструкція по активації.";
$lang['register_success_emailmessage_suppressed'] = "Обліковий запис створено.";

$lang['resetkey_invalid'] = "Ключ скидання пароля неправильного формату.";
$lang['resetkey_incorrect'] = "Ключ скидання пароля невірний.";
$lang['resetkey_expired'] = "Термін дії ключа скидання пароля закінчився!";

$lang['activationkey_invalid'] = "Неприпустимий ключ активації облікового запису.";
$lang['activationkey_incorrect'] = "Невірний ключ активації облікового запису.";
$lang['activationkey_expired'] = "Термін дії ключа активації закінчився!";

$lang['reset_requested'] = "Запит на скидання пароля надіслано поштою.";
$lang['reset_requested_emailmessage_suppressed'] = "Запит скидання пароля створений.";
$lang['reset_exists'] = "Скидання пароля вже запитане.";
$lang['password_reset'] = "Пароль скинутий успішно.";

$lang['already_activated'] = "Обліковий запис вже активований.";
$lang['activation_sent'] = "Повідомлення з інструкцією по активації облікового запису вислано.";
$lang['activation_exists'] = "Ми вже висилали вам повідомлення з інструкцією по активації облікового запису.";

$lang['email_activation_subject'] = "%s — активація облікового запису";
$lang['email_activation_body'] = 'Здрастуйте,<br/><br/>Для входу в систему вам потрібно спочатку активувати ваш аккаунт. Перейдіть, будь ласка, за цим посиланням:<br/><br/><strong><a href="%1$s/%2$s">%1$s/%2$s</a></strong><br/><br/> і введіть наступний ключ активації: <strong>%3$s</strong><br/><br/> Якщо ви не реєструвалися на сайті %1$s, значить це повідомлення ви отримали помилково. Будь ласка, проігноруйте його.';
$lang['email_activation_altbody'] = 'Здрастуйте, \n\n для входу в систему вам потрібно спочатку активувати ваш аккаунт. Перейдіть, будь ласка, за цим посиланням: \n %1$s/%2$s \n\n і введіть наступний ключ активації: %3$s \n\n Якщо ви не реєструвалися на сайті %1$s, значить це повідомлення ви отримали помилково. Будь ласка, проігноруйте його.';

$lang['email_reset_subject'] = "%s — запит скидання пароля";
$lang['email_reset_body'] = 'Здрастуйте,<br/><br/>Для скидання вашого пароля пройдіть, будь ласка, за цим посиланням:<br/><br/><strong><a href="%1$s/%2$s">%1$s/%2$s</a></strong><br/><br/>Вам потрібно буде використовувати наступний ключ для скидання пароля: <strong>%3$s</strong><br/><br/>Якщо ви недавно не запитували скидання пароля на сайті %1$s, значить це повідомлення ви отримали помилково. Будь ласка, проігноруйте його.';
$lang['email_reset_altbody'] = 'Здрастуйте, \n\n Для скидання вашого пароля пройдіть, будь ласка, за цим посиланням: \n %1$s/%2$s\n\n Вам потрібно буде використовувати наступний ключ для скидання пароля: %3$s\n\n Якщо ви недавно не запитували скидання пароля на сайті %1$s, значить це повідомлення ви отримали помилково. Будь ласка, проігноруйте його.';

$lang['account_deleted'] = "Обліковий запис видалений.";
$lang['function_disabled'] = "Ця функція була відключена.";
$lang['account_not_found'] = "Не знайдено жодного акаунту з цією адресою електронної пошти.";

return $lang;
